import tasks


welcom = ["__        __  _____   _        ____    ___    __  __   _____ ",
          "\\ \\      / / | ____| | |      / ___|  / _ \\  |  \\/  | | ____|",
          " \\ \\ /\\ / /  |  _|   | |     | |     | | | | | |\\/| | |  _|",
          "  \\ V  V /   | |___  | |___  | |___  | |_| | | |  | | | |___ ",
          "   \\_/\\_/    |_____| |_____|  \\____|  \\___/  |_|  |_| |_____|"]
print("______________________________________________________", *welcom, sep="\n")
while True:
    print("______________________________________________________")
    day = input("Введите дату урока(-ов)(дд.мм): ")
    if day == "0":
        print("Завершение работы...")
        break

    if day == "24.09":
        while True:
            print("______________________________________________________", f"Выбрана дата: {day}", sep="\n")
            task = input("Введите номер задания(1-3, 0 для возвращения): ")
            if task == "0":
                print("Возвращение к выбору даты...")
                break
            elif task == "1":
                tasks.T2409.task1(input())
            elif task == "2":
                tasks.T2409.task2(int(input()), int(input()), int(input()), int(input()))
            elif task == "3":
                tasks.T2409.task3()
            else:
                print("Некорректный ввод")

    elif day == "25.09":
        while True:
            print("______________________________________________________", f"Выбрана дата: {day}", sep="\n")
            task = input("Введите номер задания(1-4, 0 для возвращения): ")
            if task == "0":
                print("Возвращение к выбору даты...")
                break
            elif task == "1":
                tasks.T2509.task1(int(input()), int(input()))
            elif task == "2":
                if input("Хотите вставить свои числа? (Y/N) ").upper() == "Y":
                    tasks.T2509.task2(int(input()), int(input()))
                else:
                    tasks.T2509.task2()
            elif task == "3":
                tasks.T2509.task3(int(input("Введите стоимость(рубли): ")), int(input("Введите стоимость(копейки): ")), int(input("Введите количество: ")))
            elif task == "4":
                tasks.T2509.task4(int(input("Введите трёхзначное число: ")))
            else:
                print("Некорректный ввод")

    else:
        print("Некорректный ввод")